20240120172550-creating_a_concrete_class.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating a Concrete Class</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Creating a Concrete Class</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcb808cc">1. Creating a Concrete Class</a>
<ul>
<li><a href="#orgc28321f">1.1. Example</a></li>
<li><a href="#orgfab3b2c">1.2. Example</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb808cc" class="outline-2">
<h2 id="orgcb808cc"><span class="section-number-2">1.</span> Creating a Concrete Class</h2>
<div class="outline-text-2" id="text-1">
<p>
An <a href="20240120172514-introducing_abstract_classes.html#ID-a1091361-fe51-4d9a-97dc-1178bc14226e">abstract classe</a> becomes usable when it is extended by a <b>concrete</b> <code>subclass</code>.
A <b>concrete</b> class is a <b>non­abstract</b> <code>class</code>.
</p>

<p>
The first <b>concrete</b> <code>subclass</code> that extends an <code>abstract class</code> is required to <b>implement all inherited</b> <a href="20240120172537-declaring_abstract_methods.html#ID-3e6ed9f7-a719-4f68-94f0-29cb4914ebf2">abstract methods</a>.
</p>


<p>
An <code>abstract class</code> can extend a <code>non-abstract class</code> and vice versa.
</p>

<p>
Anytime a <b>concrete</b> <code>class</code> is extending an <code>abstract class</code>, it must <code>implement</code> <b>all</b> of the methods that are <b>inherited</b> as <code>abstract</code>.
</p>
</div>

<div id="outline-container-orgc28321f" class="outline-3">
<h3 id="orgc28321f"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Let’s illustrate this with a set of inherited classes:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Mammal</span> {
    <span class="org-keyword">abstract</span> <span class="org-type">void</span> <span class="org-function-name">showHorn</span>();
    <span class="org-keyword">abstract</span> <span class="org-type">void</span> <span class="org-function-name">eatLeaf</span>();
}

<span class="org-keyword">public</span> <span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Rhino</span> <span class="org-keyword">extends</span> <span class="org-type">Mammal</span> {
    <span class="org-type">void</span> <span class="org-function-name">showHorn</span>() {} <span class="org-comment-delimiter">// </span><span class="org-comment">Inherited from Mammal
</span>}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">BlackRhino</span> <span class="org-keyword">extends</span> <span class="org-type">Rhino</span> {
    <span class="org-type">void</span> <span class="org-function-name">eatLeaf</span>() {} <span class="org-comment-delimiter">// </span><span class="org-comment">Inherited from Mammal
</span>}
</pre>
</div>

<p>
In the above example, the <code>BlackRhino</code> class is the first <b>concrete</b> <code>subclass</code>, while the <code>Mammal</code> and <code>Rhino</code> classes are <b>abstract</b>.
</p>

<p>
The <code>BlackRhino</code> class inherits the <code>eatLeaf()</code> method as <code>abstract</code> and is therefore required to provide an implementation, which it does.
</p>

<p>
What about the <code>showHorn()</code> method?
</p>

<p>
Since the <code>parent</code> class, <code>Rhino</code>, provides an implementation of <code>showHorn()</code>, the method is inherited in the <code>BlackRhino</code> as a <code>non-abstract</code> method.
</p>

<p>
For this reason, the <code>BlackRhino</code> class is <b>permitted but not required</b> to override the <code>showHorn()</code> method.
</p>

<p>
The three classes in this example are <b>correctly defined and compile</b>.
</p>
</div>
</div>

<div id="outline-container-orgfab3b2c" class="outline-3">
<h3 id="orgfab3b2c"><span class="section-number-3">1.2.</span> Example</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The following <b>concrete</b> class <code>Lion</code> <b>inherits</b> two abstract methods, <code>getName()</code> and <code>roar()</code>:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Animal</span> {
    <span class="org-keyword">abstract</span> <span class="org-type">String</span> <span class="org-function-name">getName</span>();
}

<span class="org-keyword">public</span> <span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">BigCat</span> <span class="org-keyword">extends</span> <span class="org-type">Animal</span> {
    <span class="org-keyword">protected</span> <span class="org-keyword">abstract</span> <span class="org-type">void</span> <span class="org-function-name">roar</span>();
}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Lion</span> <span class="org-keyword">extends</span> <span class="org-type">BigCat</span> {
    <span class="org-keyword">public</span> <span class="org-type">String</span> <span class="org-function-name">getName</span>() {
        <span class="org-keyword">return</span> <span class="org-string">"Lion"</span>;
    }
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">roar</span>() {
        System.out.println(<span class="org-string">"The Lion lets out a loud ROAR!"</span>);
    }
}
</pre>
</div>

<p>
In the above sample code, <code>BigCat</code> <b>extends</b> <code>Animal</code> but is marked as <code>abstract</code>; therefore, it is <b>not required</b> to provide an <code>implementation</code> for the <code>getName()</code> method.
</p>

<p>
The class <code>Lion</code> is <b>not</b> marked as <code>abstract</code>, and as the first <b>concrete</b> <code>subclass</code>, it must implement <b>all</b> of the <code>inherited</code> <code>abstract methods</code> not defined in a <code>parent class</code>.
</p>

<p>
All three of these classes <b>compile successfully</b>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
